N3b3x/hf-internal-interface-wrap/src/mcu/esp32/EspPio.cpp
/**
 * @file EspPio.cpp
 * @brief ESP32C6 RMT-based Programmable IO Channel implementation.
 *
 * This file provides the implementation for PIO operations using the
 * ESP32C6's RMT (Remote Control Transceiver) peripheral. The RMT peripheral
 * provides hardware-accelerated symbol encoding/decoding with precise timing
 * for custom protocols, IR communication, and other timing-critical
 * applications with nanosecond-level precision and interrupt-driven operation.
 *
 * @author Nebiyu Tadesse
 * @date 2025
 * @copyright HardFOC
 */
#include "EspPio.h"
#include "EspTypes_PIO.h" // Include ESP32 PIO/RMT type definitions

// C++ standard library headers (must be outside extern "C")
#include <algorithm>
#include <cstring>

// Platform-specific includes and definitions
#ifdef HF_MCU_FAMILY_ESP32
// ESP-IDF C headers must be wrapped in extern "C" for C++ compatibility
#ifdef __cplusplus
extern "C" {
#endif

#include "esp_check.h"
#include "esp_clk_tree.h"
#include "esp_heap_caps.h"
#include "esp_log.h"
#include "hal/rmt_ll.h"
#include "soc/clk_tree_defs.h"
#include "soc/soc_caps.h"

#ifdef __cplusplus
}
#endif

// static const char *TAG = "EspPio";  // Unused for now

//==============================================================================
// CONSTRUCTOR AND DESTRUCTOR
//==============================================================================

EspPio::EspPio() noexcept : BasePio(), channels_{}, global_statistics_{}, global_diagnostics_{} {}

EspPio::~EspPio() noexcept {
  if (initialized_) {
    Deinitialize();
  }
}

//==============================================================================
// INITIALIZATION AND DEINITIALIZATION
//==============================================================================

hf_pio_err_t EspPio::Initialize() noexcept {
  PlatformUniqueLock<PlatformMutex> lock(state_mutex_);

  if (initialized_) {
    ESP_LOGW(TAG, "Already initialized");
    return hf_pio_err_t::PIO_ERR_ALREADY_INITIALIZED;
  }

  // Initialize all channels to default state
  for (auto& channel : channels_) {
    channel = ChannelState{};
  }

  initialized_ = true;
  ESP_LOGI(TAG, "EspPio initialized successfully");
  return hf_pio_err_t::PIO_SUCCESS;
}

hf_pio_err_t EspPio::Deinitialize() noexcept {
  PlatformUniqueLock<PlatformMutex> lock(state_mutex_);

  if (!initialized_) {
    return hf_pio_err_t::PIO_ERR_NOT_INITIALIZED;
  }

  // Deinitialize all configured channels
  for (hf_u8_t i = 0; i < MAX_CHANNELS; ++i) {
    if (channels_[i].configured) {
      DeinitializeChannel(i);
    }
  }

  // Clear callbacks
  // transmit_callback_ = nullptr; // Removed global callback
  // receive_callback_ = nullptr; // Removed global callback
  // error_callback_ = nullptr; // Removed global callback
  // callback_user_data_ = nullptr; // Removed global callback

  initialized_ = false;
  ESP_LOGI(TAG, "EspPio deinitialized");
  return hf_pio_err_t::PIO_SUCCESS;
}

//==============================================================================
// CHANNEL CONFIGURATION
//==============================================================================

hf_pio_err_t EspPio::ConfigureChannel(hf_u8_t channel_id,
                                      const hf_pio_channel_config_t& config) noexcept {
  PlatformUniqueLock<PlatformMutex> lock(state_mutex_);

  // Lazy initialization - ensure PIO is initialized before operation
  if (!EnsureInitialized()) {
    return hf_pio_err_t::PIO_ERR_NOT_INITIALIZED;
  }

  if (!IsValidChannelId(channel_id)) {
    return hf_pio_err_t::PIO_ERR_INVALID_CHANNEL;
  }

  if (channels_[channel_id].busy) {
    return hf_pio_err_t::PIO_ERR_CHANNEL_BUSY;
  }

  // Validate channel configuration for current ESP32 variant
  hf_pio_err_t validation_result = ValidateChannelConfiguration(channel_id, config);
  if (validation_result != hf_pio_err_t::PIO_SUCCESS) {
    return validation_result;
  }

  // Store configuration
  channels_[channel_id].config = config;

  // If already configured, deinit before re-init to avoid resource leak / no-free-channel errors
  if (channels_[channel_id].configured) {
    DeinitializeChannel(channel_id);
  }
  // Initialize the channel hardware
  hf_pio_err_t result = InitializeChannel(channel_id);
  if (result != hf_pio_err_t::PIO_SUCCESS) {
    return result;
  }

  channels_[channel_id].configured = true;
  ESP_LOGI(TAG, "Channel %d configured on GPIO %d for %s: requested %uns, achieved %uns",
           channel_id, config.gpio_pin, HfRmtGetVariantName(), config.resolution_ns,
           channels_[channel_id].actual_resolution_ns);

  return hf_pio_err_t::PIO_SUCCESS;
}

//==============================================================================
// TRANSMISSION OPERATIONS
//==============================================================================

hf_pio_err_t EspPio::Transmit(hf_u8_t channel_id, const hf_pio_symbol_t* symbols,
                              size_t symbol_count, bool wait_completion) noexcept {
  PlatformUniqueLock<PlatformMutex> lock(state_mutex_);

  // Lazy initialization - ensure PIO is initialized before operation
  if (!EnsureInitialized()) {
    return hf_pio_err_t::PIO_ERR_NOT_INITIALIZED;
  }

  if (!IsValidChannelId(channel_id)) {
    return hf_pio_err_t::PIO_ERR_INVALID_CHANNEL;
  }

  if (!channels_[channel_id].configured) {
    return hf_pio_err_t::PIO_ERR_INVALID_CONFIGURATION;
  }

  if (channels_[channel_id].config.direction == hf_pio_direction_t::Receive) {
    return hf_pio_err_t::PIO_ERR_INVALID_CONFIGURATION;
  }

  if (channels_[channel_id].busy) {
    return hf_pio_err_t::PIO_ERR_CHANNEL_BUSY;
  }

  if (symbols == nullptr) {
    return hf_pio_err_t::PIO_ERR_NULL_POINTER;
  }
  if (symbol_count == 0) {
    return hf_pio_err_t::PIO_ERR_INVALID_PARAMETER;
  }

  if (symbol_count > MAX_SYMBOLS_PER_TRANSMISSION) {
    return hf_pio_err_t::PIO_ERR_BUFFER_TOO_LARGE;
  }

  // Validate symbols
  hf_pio_err_t validation_result = ValidateSymbols(symbols, symbol_count);
  if (validation_result != hf_pio_err_t::PIO_SUCCESS) {
    return validation_result;
  }

  auto& channel = channels_[channel_id];

