N3b3x/hf-internal-interface-wrap/src/mcu/esp32/EspPio.cpp
  if (channel.tx_channel == nullptr) {
    return hf_pio_err_t::PIO_ERR_NOT_INITIALIZED;
  }

  // Validate callback setup for transmission
  if (!channel.transmit_callback) {
    ESP_LOGD(TAG,
             "Transmit: No transmit callback set for channel %d - completion may not be properly "
             "handled",
             channel_id);
    // Don't fail, but warn user that they may miss transmission events
  }

  // Convert hf_pio_symbol_ts to RMT format
  rmt_symbol_word_t rmt_symbols[MAX_SYMBOLS_PER_TRANSMISSION];
  size_t rmt_symbol_count = 0;

  hf_pio_err_t convert_result =
      ConvertToRmtSymbols(symbols, symbol_count, rmt_symbols, rmt_symbol_count);
  if (convert_result != hf_pio_err_t::PIO_SUCCESS) {
    return convert_result;
  }

  // Create transmit configuration
  rmt_transmit_config_t tx_config = {};
  tx_config.loop_count = 0; // No loop
  // Hint driver to avoid extra fragmentation under tight timing
  tx_config.flags.eot_level = channel.idle_level ? 1 : 0;

  // Start transmission
  channel.busy = true;
  channel.status.is_transmitting = true;
  channel.status.symbols_queued = symbol_count;
  channel.status.timestamp_us = esp_timer_get_time();

  // Callbacks are registered at channel initialization and kept installed
  esp_err_t ret = ESP_OK;

  // Use the copy encoder to transmit the converted RMT symbols
  ret = rmt_transmit(channel.tx_channel, channel.encoder,
                     rmt_symbols, // Packed RMT symbols
                     rmt_symbol_count * sizeof(rmt_symbol_word_t), &tx_config);

  if (ret != ESP_OK) {
    channel.busy = false;
    channel.status.is_transmitting = false;
    ESP_LOGE(TAG, "Failed to start transmission on channel %d: %d", channel_id, ret);
    return hf_pio_err_t::PIO_ERR_HARDWARE_FAULT;
  }
  if (wait_completion) {
    // Wait for transmission to complete using ESP-IDF API
    TickType_t wait_ticks = portMAX_DELAY;
    if (channel.config.timeout_us > 0) {
      // Round up to next millisecond
      uint32_t timeout_ms = (channel.config.timeout_us + 999) / 1000;
      wait_ticks = pdMS_TO_TICKS(timeout_ms);
    }
    ret = rmt_tx_wait_all_done(channel.tx_channel, wait_ticks);
    if (ret != ESP_OK) {
      ESP_LOGE(TAG, "Transmission timeout on channel %d", channel_id);
      channel.busy = false;
      channel.status.is_transmitting = false;
      return hf_pio_err_t::PIO_ERR_COMMUNICATION_TIMEOUT;
    }
    channel.busy = false;
    channel.status.is_transmitting = false;
    channel.status.symbols_processed = symbol_count;
  }

  ESP_LOGD(TAG, "Started transmission of %d symbols on channel %d", symbol_count, channel_id);
  return hf_pio_err_t::PIO_SUCCESS;
}

//==============================================================================
// RECEPTION OPERATIONS
//==============================================================================

hf_pio_err_t EspPio::StartReceive(hf_u8_t channel_id, hf_pio_symbol_t* buffer, size_t buffer_size,
                                  hf_u32_t timeout_us) noexcept {
  PlatformUniqueLock<PlatformMutex> lock(state_mutex_);

  // Lazy initialization - ensure PIO is initialized before operation
  if (!EnsureInitialized()) {
    return hf_pio_err_t::PIO_ERR_NOT_INITIALIZED;
  }

  if (!IsValidChannelId(channel_id)) {
    return hf_pio_err_t::PIO_ERR_INVALID_CHANNEL;
  }

  if (!channels_[channel_id].configured) {
    return hf_pio_err_t::PIO_ERR_INVALID_CONFIGURATION;
  }

  if (channels_[channel_id].config.direction == hf_pio_direction_t::Transmit) {
    return hf_pio_err_t::PIO_ERR_INVALID_CONFIGURATION;
  }

  if (channels_[channel_id].busy) {
    return hf_pio_err_t::PIO_ERR_CHANNEL_BUSY;
  }

  if (buffer == nullptr || buffer_size == 0) {
    return hf_pio_err_t::PIO_ERR_INVALID_PARAMETER;
  }

  auto& channel = channels_[channel_id];

  if (channel.rx_channel == nullptr) {
    return hf_pio_err_t::PIO_ERR_NOT_INITIALIZED;
  }

  // Store buffer information
  channel.rx_buffer = buffer;
  channel.rx_buffer_size = buffer_size;
  channel.rx_symbols_received = 0;

  // Validate callback setup for reception
  if (!channel.receive_callback) {
    ESP_LOGD(TAG,
             "StartReceive: No receive callback set for channel %d - reception may not be properly "
             "handled",
             channel_id);
    // Don't fail, but warn user that they may miss callbacks");
  }

  // Create receive configuration
  rmt_receive_config_t rx_config = {};
  // Increase minimum signal range to account for timing variations, hardware delays, and signal
  // propagation The RMT peripheral needs a more generous range to capture signals that may have
  // slight timing differences
  rx_config.signal_range_min_ns =
      std::max(channel.actual_resolution_ns / 4,
               static_cast<hf_u32_t>(10)); // Allow signals down to 1/4 the resolution

  // Set maximum signal range to a reasonable value for most applications (1ms instead of max
  // possible) This provides better noise filtering and prevents extremely long signals from
  // blocking reception
  rx_config.signal_range_max_ns = 1000000; // 1ms maximum signal duration

  // ESP-IDF v5.5 specific RX channel configuration flags
  // Note: rmt_receive_config_t only supports en_partial_rx flag, other flags are in
  // rmt_rx_channel_config_t
  rx_config.flags.en_partial_rx = false; // Disable partial reception for standard operation

  // The RMT peripheral can handle buffers up to several KB
  // Since each RMT symbol can contain 2 PIO symbols, we need to ensure the RMT buffer is large
  // enough Use a conservative approach: allocate enough space for the requested PIO symbols
  size_t rmt_buffer_size = buffer_size; // This will be the number of RMT symbols we can receive

  // Start reception
  channel.busy = true;
  channel.status.is_receiving = true;
  channel.status.timestamp_us = esp_timer_get_time();

  // Register RX callbacks
  rmt_rx_event_callbacks_t rx_callbacks = {};
  rx_callbacks.on_recv_done = OnReceiveComplete;

  esp_err_t ret = rmt_rx_register_event_callbacks(channel.rx_channel, &rx_callbacks, this);
  if (ret != ESP_OK) {
    channel.busy = false;
    channel.status.is_receiving = false;
    ESP_LOGE(TAG, "Failed to register RX callbacks for channel %d: %d", channel_id, ret);
    return hf_pio_err_t::PIO_ERR_HARDWARE_FAULT;
  }

  // Allocate RMT buffer for reception (RMT driver requires a valid buffer)
  rmt_symbol_word_t* rmt_rx_buffer = static_cast<rmt_symbol_word_t*>(
      heap_caps_malloc(rmt_buffer_size * sizeof(rmt_symbol_word_t), MALLOC_CAP_DMA));
  if (rmt_rx_buffer == nullptr) {
    channel.busy = false;
    channel.status.is_receiving = false;
    ESP_LOGE(TAG, "Failed to allocate RMT RX buffer for channel %d", channel_id);
    return hf_pio_err_t::PIO_ERR_OUT_OF_MEMORY;
  }

  // Store the allocated RMT buffer for cleanup
  channel.rmt_rx_buffer = rmt_rx_buffer;

  ESP_LOGD(TAG, "Allocated RMT RX buffer: channel %d, size %lu symbols (%lu bytes), buffer ptr: %p",
           channel_id, rmt_buffer_size, rmt_buffer_size * sizeof(rmt_symbol_word_t), rmt_rx_buffer);

  // Start reception with allocated RMT buffer
  ESP_LOGI(TAG,
           "Starting RMT reception on channel %d with config: min=%uns, max=%uns, buffer_size=%lu "
           "symbols",
           channel_id, rx_config.signal_range_min_ns, rx_config.signal_range_max_ns,
           rmt_buffer_size);

  // CRITICAL DEBUG: Log RMT channel state before reception
  ESP_LOGI(TAG, "RMT RX channel state before reception: handle=%p, busy=%s, receiving=%s",
           channel.rx_channel, channel.busy ? "yes" : "no",
           channel.status.is_receiving ? "yes" : "no");

  // FIXED: Pass the correct buffer size in bytes to rmt_receive
  ret = rmt_receive(channel.rx_channel, rmt_rx_buffer, rmt_buffer_size, &rx_config);
  if (ret != ESP_OK) {
    channel.busy = false;
    channel.status.is_receiving = false;
    heap_caps_free(rmt_rx_buffer);
    channel.rmt_rx_buffer = nullptr;

    // ESP-IDF v5.5 specific error handling
    switch (ret) {
    case ESP_ERR_INVALID_ARG:
      ESP_LOGE(TAG, "Invalid arguments for RMT reception on channel %d", channel_id);
      return hf_pio_err_t::PIO_ERR_INVALID_PARAMETER;
    case ESP_ERR_INVALID_STATE:
      ESP_LOGE(TAG, "RMT channel %d not in valid state for reception", channel_id);
      return hf_pio_err_t::PIO_ERR_INVALID_CONFIGURATION;
    case ESP_ERR_NO_MEM:
      ESP_LOGE(TAG, "Insufficient memory for RMT reception on channel %d", channel_id);
      return hf_pio_err_t::PIO_ERR_OUT_OF_MEMORY;
    default:
      ESP_LOGE(TAG, "Failed to start reception on channel %d: %s (error: %d)", channel_id,
               esp_err_to_name(ret), ret);
      return hf_pio_err_t::PIO_ERR_HARDWARE_FAULT;
    }
  }

  ESP_LOGI(TAG, "Started reception on channel %d", channel_id);
  return hf_pio_err_t::PIO_SUCCESS;
}

