N3b3x/hf-internal-interface-wrap/src/mcu/esp32/EspPio.cpp
hf_pio_err_t EspPio::StopReceive(hf_u8_t channel_id, size_t& symbols_received) noexcept {
  PlatformUniqueLock<PlatformMutex> lock(state_mutex_);

  if (!initialized_) {
    return hf_pio_err_t::PIO_ERR_NOT_INITIALIZED;
  }

  if (!IsValidChannelId(channel_id)) {
    return hf_pio_err_t::PIO_ERR_INVALID_CHANNEL;
  }

  auto& channel = channels_[channel_id];

  if (!channel.status.is_receiving) {
    symbols_received = 0;
    return hf_pio_err_t::PIO_ERR_INVALID_CONFIGURATION;
  }

  // Stop reception
  channel.busy = false;
  channel.status.is_receiving = false;
  symbols_received = channel.rx_symbols_received;

  // Free the allocated RMT buffer
  if (channel.rmt_rx_buffer != nullptr) {
    heap_caps_free(channel.rmt_rx_buffer);
    channel.rmt_rx_buffer = nullptr;
  }

  ESP_LOGI(TAG, "Stopped reception on channel %d, received %d symbols", channel_id,
           symbols_received);
  return hf_pio_err_t::PIO_SUCCESS;
}

//==============================================================================
// STATUS AND CAPABILITIES
//==============================================================================

bool EspPio::IsChannelBusy(hf_u8_t channel_id) const noexcept {
  PlatformUniqueLock<PlatformMutex> lock(state_mutex_);

  if (!IsValidChannelId(channel_id)) {
    return false;
  }

  return channels_[channel_id].busy;
}

hf_pio_err_t EspPio::GetChannelStatus(hf_u8_t channel_id,
                                      hf_pio_channel_status_t& status) const noexcept {
  PlatformUniqueLock<PlatformMutex> lock(state_mutex_);

  if (!IsValidChannelId(channel_id)) {
    return hf_pio_err_t::PIO_ERR_INVALID_CHANNEL;
  }

  status = channels_[channel_id].status;
  status.is_initialized = channels_[channel_id].configured;
  status.is_busy = channels_[channel_id].busy;

  return hf_pio_err_t::PIO_SUCCESS;
}

hf_pio_err_t EspPio::GetCapabilities(hf_pio_capabilities_t& capabilities) const noexcept {
  capabilities.max_channels = MAX_CHANNELS;
  capabilities.min_resolution_ns = 12.5;    // Based on 80MHz RMT clock
  capabilities.max_resolution_ns = 3355443; // Max with divider
  capabilities.max_duration = 32767;        // 15-bit duration field
  capabilities.max_buffer_size = MAX_SYMBOLS_PER_TRANSMISSION;
  capabilities.supports_bidirectional = false; // RMT is unidirectional per channel
  capabilities.supports_loopback = true;
  capabilities.supports_carrier = true;

  return hf_pio_err_t::PIO_SUCCESS;
}

//==============================================================================
// CALLBACK MANAGEMENT
//==============================================================================

void EspPio::SetTransmitCallback(hf_u8_t channel_id, hf_pio_transmit_callback_t callback,
                                 void* user_data) noexcept {
  PlatformUniqueLock<PlatformMutex> lock(state_mutex_);

  if (!IsValidChannelId(channel_id)) {
    ESP_LOGE(TAG, "SetTransmitCallback: Invalid channel ID %d", channel_id);
    return;
  }

  if (!callback) {
    ESP_LOGW(TAG, "SetTransmitCallback: Null callback provided for channel %d", channel_id);
    return;
  }

  auto& channel = channels_[channel_id];

  // Validate channel configuration for transmit capability
  if (channel.config.direction == hf_pio_direction_t::Receive) {
    ESP_LOGW(TAG, "SetTransmitCallback: Channel %d is RX-only, cannot set TX callback", channel_id);
    return;
  }

  channel.transmit_callback = callback;
  channel.transmit_user_data = user_data;

  ESP_LOGI(TAG, "SetTransmitCallback: TX callback set for channel %d with user data %p", channel_id,
           user_data);
}

void EspPio::SetReceiveCallback(hf_u8_t channel_id, hf_pio_receive_callback_t callback,
                                void* user_data) noexcept {
  PlatformUniqueLock<PlatformMutex> lock(state_mutex_);

  if (!IsValidChannelId(channel_id)) {
    ESP_LOGE(TAG, "SetReceiveCallback: Invalid channel ID %d", channel_id);
    return;
  }

  if (!callback) {
    ESP_LOGW(TAG, "SetReceiveCallback: Null callback provided for channel %d", channel_id);
    return;
  }

  auto& channel = channels_[channel_id];

  // Validate channel configuration for receive capability
  if (channel.config.direction == hf_pio_direction_t::Transmit) {
    ESP_LOGW(TAG, "SetReceiveCallback: Channel %d is TX-only, cannot set RX callback", channel_id);
    return;
  }

  channel.receive_callback = callback;
  channel.receive_user_data = user_data;

  ESP_LOGI(TAG, "SetReceiveCallback: RX callback set for channel %d with user data %p", channel_id,
           user_data);
}

void EspPio::SetErrorCallback(hf_u8_t channel_id, hf_pio_error_callback_t callback,
                              void* user_data) noexcept {
  PlatformUniqueLock<PlatformMutex> lock(state_mutex_);

  if (!IsValidChannelId(channel_id)) {
    ESP_LOGE(TAG, "SetErrorCallback: Invalid channel ID %d", channel_id);
    return;
  }

  if (!callback) {
    ESP_LOGW(TAG, "SetErrorCallback: Null callback provided for channel %d", channel_id);
    return;
  }

  auto& channel = channels_[channel_id];

  // Error callbacks can be set for any channel type
  channel.error_callback = callback;
  channel.error_user_data = user_data;

  ESP_LOGI(TAG, "SetErrorCallback: Error callback set for channel %d with user data %p", channel_id,
           user_data);
}

void EspPio::ClearChannelCallbacks(hf_u8_t channel_id) noexcept {
  PlatformUniqueLock<PlatformMutex> lock(state_mutex_);

  if (!IsValidChannelId(channel_id)) {
    ESP_LOGE(TAG, "ClearChannelCallbacks: Invalid channel ID %d", channel_id);
    return;
  }

  auto& channel = channels_[channel_id];

  // Check what callbacks were set before clearing
  bool had_tx = channel.transmit_callback != nullptr;
  bool had_rx = channel.receive_callback != nullptr;
  bool had_error = channel.error_callback != nullptr;

  // Clear all callbacks for the specific channel
  channel.transmit_callback = nullptr;
  channel.transmit_user_data = nullptr;
  channel.receive_callback = nullptr;
  channel.receive_user_data = nullptr;
  channel.error_callback = nullptr;
  channel.error_user_data = nullptr;

