N3b3x/hf-internal-interface-wrap/src/mcu/esp32/EspPio.cpp
  ESP_LOGI(TAG, "ClearChannelCallbacks: Cleared callbacks for channel %d (TX:%s, RX:%s, ERR:%s)",
           channel_id, had_tx ? "yes" : "no", had_rx ? "yes" : "no", had_error ? "yes" : "no");
}

void EspPio::ClearCallbacks() noexcept {
  PlatformUniqueLock<PlatformMutex> lock(state_mutex_);

  for (hf_u8_t i = 0; i < MAX_CHANNELS; ++i) {
    auto& channel = channels_[i];
    channel.transmit_callback = nullptr;
    channel.transmit_user_data = nullptr;
    channel.receive_callback = nullptr;
    channel.receive_user_data = nullptr;
    channel.error_callback = nullptr;
    channel.error_user_data = nullptr;
  }

  ESP_LOGI(TAG, "ClearCallbacks: Cleared all callbacks across all channels");
}

//==============================================================================
// ESP32-SPECIFIC METHODS
//==============================================================================

hf_pio_err_t EspPio::ConfigureCarrier(hf_u8_t channel_id, hf_u32_t carrier_freq_hz,
                                      float duty_cycle) noexcept {
  PlatformUniqueLock<PlatformMutex> lock(state_mutex_);

  if (!IsValidChannelId(channel_id)) {
    return hf_pio_err_t::PIO_ERR_INVALID_CHANNEL;
  }

  if (!channels_[channel_id].configured) {
    return hf_pio_err_t::PIO_ERR_INVALID_CONFIGURATION;
  }

  if (duty_cycle < 0.0f || duty_cycle > 1.0f) {
    return hf_pio_err_t::PIO_ERR_INVALID_PARAMETER;
  }

  // Configure carrier modulation using RMT carrier configuration
  auto& channel = channels_[channel_id];

  if (channel.tx_channel == nullptr) {
    return hf_pio_err_t::PIO_ERR_NOT_INITIALIZED;
  }

  rmt_carrier_config_t carrier_config = {};
  carrier_config.frequency_hz = carrier_freq_hz;
  carrier_config.duty_cycle = duty_cycle;

  esp_err_t ret = rmt_apply_carrier(channel.tx_channel, &carrier_config);
  if (ret != ESP_OK) {
    ESP_LOGE(TAG, "Failed to configure carrier on channel %d: %d", channel_id, ret);
    return hf_pio_err_t::PIO_ERR_HARDWARE_FAULT;
  }

  ESP_LOGI(TAG, "Configured carrier on channel %d: %d Hz, %.2f%% duty", channel_id, carrier_freq_hz,
           duty_cycle * 100.0f);
  return hf_pio_err_t::PIO_SUCCESS;
}

hf_pio_err_t EspPio::EnableLoopback(hf_u8_t channel_id, bool enable) noexcept {
  PlatformUniqueLock<PlatformMutex> lock(state_mutex_);

  if (!IsValidChannelId(channel_id)) {
    return hf_pio_err_t::PIO_ERR_INVALID_CHANNEL;
  }

  // Configure loopback mode
  ESP_LOGI(TAG, "Loopback %s for channel %d", enable ? "enabled" : "disabled", channel_id);
  return hf_pio_err_t::PIO_SUCCESS;
}

//==============================================================================
// ADVANCED LOW-LEVEL RMT CONTROL METHODS
//==============================================================================

hf_pio_err_t EspPio::ConfigureAdvancedRmt(hf_u8_t channel_id, size_t memory_blocks, bool enable_dma,
                                          hf_u32_t queue_depth) noexcept {
  if (!EnsureInitialized()) {
    return hf_pio_err_t::PIO_ERR_NOT_INITIALIZED;
  }

  if (!IsValidChannelId(channel_id)) {
    return hf_pio_err_t::PIO_ERR_INVALID_CHANNEL;
  }

  if (!channels_[channel_id].configured) {
    return hf_pio_err_t::PIO_ERR_INVALID_CONFIGURATION;
  }

  ESP_LOGI(TAG, "Configuring advanced RMT: channel=%d, memory_blocks=%lu, dma=%s, queue=%d",
           channel_id, memory_blocks, enable_dma ? "yes" : "no", queue_depth);

  PlatformUniqueLock<PlatformMutex> lock(state_mutex_);
  auto& channel = channels_[channel_id];

  // For existing channels, we need to reconfigure them with advanced settings
  if (channel.tx_channel || channel.rx_channel) {
    // Store current configuration
    hf_pio_channel_config_t stored_config = channel.config;

    // Deinitialize the channel to reconfigure it
    hf_pio_err_t deinit_result = DeinitializeChannel(channel_id);
    if (deinit_result != hf_pio_err_t::PIO_SUCCESS) {
      ESP_LOGE(TAG, "Failed to deinitialize channel for advanced reconfiguration");
      return deinit_result;
    }

    // Reconfigure with advanced settings
    const auto& config = stored_config;
    hf_u32_t actual_resolution_ns;
    hf_u32_t resolution_hz =
        CalculateResolutionHz(config.resolution_ns, actual_resolution_ns, channel.source_clock_hz);

    // Store the actual resolution achieved
    channel.actual_resolution_ns = actual_resolution_ns;

    if (config.direction == hf_pio_direction_t::Transmit ||
        config.direction == hf_pio_direction_t::Bidirectional) {
      // Configure advanced TX channel for ESP32-C6 compatibility
      rmt_tx_channel_config_t tx_config = {};
      tx_config.gpio_num = static_cast<gpio_num_t>(config.gpio_pin);
      tx_config.clk_src = RMT_CLK_SRC_DEFAULT; // APB on ESP32, PLL_F80M on C6 (both 80 MHz)

      tx_config.resolution_hz = resolution_hz;
      tx_config.mem_block_symbols = static_cast<hf_u32_t>(memory_blocks);
      tx_config.trans_queue_depth = queue_depth;

      if (enable_dma) {
        ESP_LOGI(TAG, "Enabling DMA for TX channel %d", channel_id);
      }

      esp_err_t ret = rmt_new_tx_channel(&tx_config, &channel.tx_channel);
      if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to create advanced TX channel %d: %s", channel_id,
                 esp_err_to_name(ret));
        return hf_pio_err_t::PIO_ERR_HARDWARE_FAULT;
      }

      // Create appropriate encoder based on configuration
      if (enable_dma) {
        // Use bytes encoder for DMA-optimized operation
        rmt_bytes_encoder_config_t bytes_config = {};
        bytes_config.bit0.level0 = 1;
        bytes_config.bit0.duration0 = 1;
        bytes_config.bit0.level1 = 0;
        bytes_config.bit0.duration1 = 1;
        bytes_config.bit1.level0 = 1;
        bytes_config.bit1.duration0 = 2;
        bytes_config.bit1.level1 = 0;
        bytes_config.bit1.duration1 = 1;

        ret = rmt_new_bytes_encoder(&bytes_config, &channel.bytes_encoder);
        if (ret != ESP_OK) {
          ESP_LOGW(TAG, "Failed to create bytes encoder, using copy encoder");
          rmt_copy_encoder_config_t copy_config = {};
          ret = rmt_new_copy_encoder(&copy_config, &channel.encoder);
        } else {
          channel.encoder = channel.bytes_encoder;
        }
      } else {
        // Use copy encoder for standard operation
        rmt_copy_encoder_config_t copy_config = {};
        ret = rmt_new_copy_encoder(&copy_config, &channel.encoder);
      }

      if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to create encoder for advanced channel %d: %s", channel_id,
                 esp_err_to_name(ret));
        rmt_del_channel(channel.tx_channel);
        channel.tx_channel = nullptr;
        return hf_pio_err_t::PIO_ERR_HARDWARE_FAULT;
      }

      // Enable channel
      ret = rmt_enable(channel.tx_channel);
      if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to enable advanced TX channel %d: %s", channel_id,
                 esp_err_to_name(ret));
        return hf_pio_err_t::PIO_ERR_HARDWARE_FAULT;
      }
    }

    if (config.direction == hf_pio_direction_t::Receive ||
        config.direction == hf_pio_direction_t::Bidirectional) {
      // Configure advanced RX channel for ESP32-C6 compatibility
      rmt_rx_channel_config_t rx_config = {};
      rx_config.gpio_num = static_cast<gpio_num_t>(config.gpio_pin);
      rx_config.clk_src = RMT_CLK_SRC_DEFAULT; // APB on ESP32, PLL_F80M on C6 (both 80 MHz)
      rx_config.resolution_hz = resolution_hz;
      rx_config.mem_block_symbols = static_cast<hf_u32_t>(memory_blocks);

      esp_err_t ret = rmt_new_rx_channel(&rx_config, &channel.rx_channel);
      if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to create advanced RX channel %d: %s", channel_id,
                 esp_err_to_name(ret));
        return hf_pio_err_t::PIO_ERR_HARDWARE_FAULT;
      }

      // Enable channel
      ret = rmt_enable(channel.rx_channel);
      if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to enable advanced RX channel %d: %s", channel_id,
                 esp_err_to_name(ret));
        return hf_pio_err_t::PIO_ERR_HARDWARE_FAULT;
      }
    }

    // Restore configuration
    channel.config = stored_config;
    channel.configured = true;
  }

