N3b3x/hf-internal-interface-wrap/src/mcu/esp32/EspPio.cpp
  ESP_LOGI(TAG,
           "Advanced RMT configuration completed for channel %d with %lu memory blocks, DMA=%s, "
           "queue depth=%d",
           channel_id, memory_blocks, enable_dma ? "enabled" : "disabled", queue_depth);
  return hf_pio_err_t::PIO_SUCCESS;
}

//==============================================================================
// ADVANCED PIO FUNCTION IMPLEMENTATIONS
//==============================================================================

hf_pio_err_t EspPio::ConfigureEncoder(hf_u8_t channel_id, const hf_pio_symbol_t& bit0_config,
                                      const hf_pio_symbol_t& bit1_config) noexcept {
  if (!EnsureInitialized()) {
    return hf_pio_err_t::PIO_ERR_NOT_INITIALIZED;
  }

  if (!IsValidChannelId(channel_id)) {
    return hf_pio_err_t::PIO_ERR_INVALID_CHANNEL;
  }

  if (!channels_[channel_id].configured) {
    return hf_pio_err_t::PIO_ERR_INVALID_CONFIGURATION;
  }

  auto& channel = channels_[channel_id];

  if (channel.tx_channel == nullptr) {
    ESP_LOGE(TAG, "TX channel not configured for encoder setup on channel %d", channel_id);
    return hf_pio_err_t::PIO_ERR_NOT_INITIALIZED;
  }

  // Create or reconfigure bytes encoder with custom bit patterns
  if (channel.bytes_encoder) {
    rmt_del_encoder(channel.bytes_encoder);
    channel.bytes_encoder = nullptr;
  }

  rmt_bytes_encoder_config_t encoder_config = {};
  // Configure bit 0 pattern
  encoder_config.bit0.level0 = bit0_config.level ? 1 : 0;
  encoder_config.bit0.duration0 = bit0_config.duration;
  encoder_config.bit0.level1 = bit0_config.level ? 0 : 1;   // Complement for return
  encoder_config.bit0.duration1 = bit0_config.duration / 2; // Half duration for return

  // Configure bit 1 pattern
  encoder_config.bit1.level0 = bit1_config.level ? 1 : 0;
  encoder_config.bit1.duration0 = bit1_config.duration;
  encoder_config.bit1.level1 = bit1_config.level ? 0 : 1;   // Complement for return
  encoder_config.bit1.duration1 = bit1_config.duration / 2; // Half duration for return

  esp_err_t ret = rmt_new_bytes_encoder(&encoder_config, &channel.bytes_encoder);
  if (ret != ESP_OK) {
    ESP_LOGE(TAG, "Failed to configure encoder for channel %d: %s", channel_id,
             esp_err_to_name(ret));
    return hf_pio_err_t::PIO_ERR_HARDWARE_FAULT;
  }

  // Update the primary encoder reference
  channel.encoder = channel.bytes_encoder;

  ESP_LOGI(TAG, "Configured encoder for channel %d with custom bit patterns", channel_id);
  return hf_pio_err_t::PIO_SUCCESS;
}

hf_pio_err_t EspPio::SetIdleLevel(hf_u8_t channel_id, bool idle_level) noexcept {
  if (!EnsureInitialized()) {
    return hf_pio_err_t::PIO_ERR_NOT_INITIALIZED;
  }

  if (!IsValidChannelId(channel_id)) {
    return hf_pio_err_t::PIO_ERR_INVALID_CHANNEL;
  }

  if (!channels_[channel_id].configured) {
    return hf_pio_err_t::PIO_ERR_INVALID_CONFIGURATION;
  }

  // Store idle level in configuration for future transmissions
  // Store idle level in channel state instead of config
  channels_[channel_id].idle_level = idle_level;

  ESP_LOGD(TAG, "Set idle level %s for channel %d", idle_level ? "HIGH" : "LOW", channel_id);
  return hf_pio_err_t::PIO_SUCCESS;
}

hf_pio_err_t EspPio::GetChannelStatistics(hf_u8_t channel_id,
                                          hf_pio_channel_statistics_t& stats) const noexcept {
  if (!IsValidChannelId(channel_id)) {
    return hf_pio_err_t::PIO_ERR_INVALID_CHANNEL;
  }

  const auto& channel = channels_[channel_id];

  // Fill statistics structure
  stats.total_transmissions = 0;  // Would be tracked in real implementation
  stats.total_receptions = 0;     // Would be tracked in real implementation
  stats.failed_transmissions = 0; // Would be tracked in real implementation
  stats.failed_receptions = 0;    // Would be tracked in real implementation
  stats.last_operation_time = channel.last_operation_time;
  stats.is_configured = channel.configured;
  stats.is_busy = channel.busy;
  stats.current_resolution_ns = channel.actual_resolution_ns; // Use actual achieved resolution
  stats.memory_blocks_allocated = 64;                         // Default or actual allocation
  stats.dma_enabled = false; // Would be tracked based on channel configuration

  return hf_pio_err_t::PIO_SUCCESS;
}

hf_pio_err_t EspPio::ResetChannelStatistics(hf_u8_t channel_id) noexcept {
  if (!IsValidChannelId(channel_id)) {
    return hf_pio_err_t::PIO_ERR_INVALID_CHANNEL;
  }
  return hf_pio_err_t::PIO_SUCCESS;
}

hf_pio_err_t EspPio::GetActualResolution(hf_u8_t channel_id,
                                         hf_u32_t& achieved_resolution_ns) const noexcept {
  if (!IsValidChannelId(channel_id)) {
    return hf_pio_err_t::PIO_ERR_INVALID_CHANNEL;
  }

  const auto& channel = channels_[channel_id];
  if (!channel.configured) {
    return hf_pio_err_t::PIO_ERR_INVALID_CONFIGURATION;
  }

  achieved_resolution_ns = channel.actual_resolution_ns;
  return hf_pio_err_t::PIO_SUCCESS;
}

hf_u32_t EspPio::CalculateResolutionHz(hf_u32_t resolution_ns, hf_u32_t& actual_resolution_ns,
                                       hf_u32_t source_clock_hz) const noexcept {
  // Use the internal clock divider calculation to get the actual achievable resolution
  [[maybe_unused]] hf_u32_t divider =
      CalculateClockDivider(resolution_ns, actual_resolution_ns, source_clock_hz);

  // Convert the actual resolution back to Hz for the RMT peripheral
  // resolution_hz = 1e9 / actual_resolution_ns
  hf_u32_t resolution_hz = 1000000000UL / actual_resolution_ns;

  // ESP_LOGD(TAG, "Resolution conversion: %uns -> %u Hz (actual: %uns)",
  //          resolution_ns, resolution_hz, actual_resolution_ns);

  return resolution_hz;
}

hf_pio_err_t EspPio::GetResolutionConstraints(hf_u32_t& min_resolution_ns,
                                              hf_u32_t& max_resolution_ns,
                                              hf_u32_t& clock_freq_hz) const noexcept {
  clock_freq_hz = RMT_CLK_SRC_FREQ;

  // Calculate minimum resolution (divider = 1)
  min_resolution_ns = 1000000000UL / RMT_CLK_SRC_FREQ;

