N3b3x/hf-internal-interface-wrap/src/mcu/esp32/EspPio.cpp
  // Calculate maximum resolution (divider = 255)
  max_resolution_ns = (1000000000ULL * 255) / RMT_CLK_SRC_FREQ;

  // ESP_LOGD(TAG, "Resolution constraints: min=%uns, max=%uns, clock=%u Hz",
  //          min_resolution_ns, max_resolution_ns, clock_freq_hz);

  return hf_pio_err_t::PIO_SUCCESS;
}

//==============================================================================
// MISSING ADVANCED PIO FUNCTION IMPLEMENTATIONS
//==============================================================================

hf_pio_err_t EspPio::TransmitRawRmtSymbols(hf_u8_t channel_id, const rmt_symbol_word_t* rmt_symbols,
                                           size_t symbol_count, bool wait_completion) noexcept {
  PlatformUniqueLock<PlatformMutex> lock(state_mutex_);

  // Lazy initialization - ensure PIO is initialized before operation
  if (!EnsureInitialized()) {
    return hf_pio_err_t::PIO_ERR_NOT_INITIALIZED;
  }

  if (!IsValidChannelId(channel_id)) {
    return hf_pio_err_t::PIO_ERR_INVALID_CHANNEL;
  }

  if (!channels_[channel_id].configured) {
    return hf_pio_err_t::PIO_ERR_INVALID_CONFIGURATION;
  }

  if (channels_[channel_id].busy) {
    return hf_pio_err_t::PIO_ERR_CHANNEL_BUSY;
  }

  if (rmt_symbols == nullptr || symbol_count == 0) {
    return hf_pio_err_t::PIO_ERR_INVALID_PARAMETER;
  }

  auto& channel = channels_[channel_id];

  if (channel.tx_channel == nullptr) {
    ESP_LOGE(TAG, "TX channel not configured for channel %d", channel_id);
    return hf_pio_err_t::PIO_ERR_NOT_INITIALIZED;
  }

  channels_[channel_id].busy = true;
  channels_[channel_id].status.is_transmitting = true;
  channels_[channel_id].status.symbols_queued = symbol_count;
  channels_[channel_id].status.timestamp_us = esp_timer_get_time();

  // Create transmission configuration
  rmt_transmit_config_t tx_config = {};
  tx_config.loop_count = 0; // Single transmission
  // For raw RMT symbols, we transmit directly using the copy encoder
  esp_err_t result = rmt_transmit(channel.tx_channel, channel.encoder,
                                  rmt_symbols, // Raw symbols for copy encoder
                                  symbol_count * sizeof(rmt_symbol_word_t), &tx_config);

  if (result != ESP_OK) {
    channels_[channel_id].busy = false;
    channels_[channel_id].status.is_transmitting = false;
    ESP_LOGE(TAG, "Raw RMT symbol transmission failed on channel %d: %s", channel_id,
             esp_err_to_name(result));
    InvokeChannelErrorCallback(channel_id, hf_pio_err_t::PIO_ERR_COMMUNICATION_FAILURE);
    return hf_pio_err_t::PIO_ERR_COMMUNICATION_FAILURE;
  }

  // Wait for completion if requested
  if (wait_completion) {
    hf_u32_t timeout_ms = channel.config.timeout_us / 1000;
    if (timeout_ms == 0)
      timeout_ms = portMAX_DELAY;

    result = rmt_tx_wait_all_done(channel.tx_channel, pdMS_TO_TICKS(timeout_ms));
    if (result != ESP_OK) {
      ESP_LOGW(TAG, "Wait for transmission completion timed out on channel %d: %s", channel_id,
               esp_err_to_name(result));
      InvokeChannelErrorCallback(channel_id, hf_pio_err_t::PIO_ERR_COMMUNICATION_TIMEOUT);
      return hf_pio_err_t::PIO_ERR_COMMUNICATION_TIMEOUT;
    }

    // Update status after successful completion
    channels_[channel_id].busy = false;
    channels_[channel_id].status.is_transmitting = false;
    channels_[channel_id].status.symbols_processed = symbol_count;
    channels_[channel_id].status.timestamp_us = esp_timer_get_time();
    channels_[channel_id].status.last_error = hf_pio_err_t::PIO_SUCCESS;
  }

  return hf_pio_err_t::PIO_SUCCESS;
}

hf_pio_err_t EspPio::ReceiveRawRmtSymbols(hf_u8_t channel_id, rmt_symbol_word_t* rmt_buffer,
                                          size_t buffer_size, size_t& symbols_received,
                                          hf_u32_t timeout_us) noexcept {
  PlatformUniqueLock<PlatformMutex> lock(state_mutex_);

  // Lazy initialization - ensure PIO is initialized before operation
  if (!EnsureInitialized()) {
    return hf_pio_err_t::PIO_ERR_NOT_INITIALIZED;
  }

  if (!IsValidChannelId(channel_id)) {
    return hf_pio_err_t::PIO_ERR_INVALID_CHANNEL;
  }

  if (!channels_[channel_id].configured) {
    return hf_pio_err_t::PIO_ERR_INVALID_CONFIGURATION;
  }

  if (rmt_buffer == nullptr || buffer_size == 0) {
    symbols_received = 0;
    return hf_pio_err_t::PIO_ERR_INVALID_PARAMETER;
  }

  auto& channel = channels_[channel_id];

  if (channel.rx_channel == nullptr) {
    ESP_LOGE(TAG, "RX channel not configured for channel %d", channel_id);
    symbols_received = 0;
    return hf_pio_err_t::PIO_ERR_NOT_INITIALIZED;
  }

  // Prepare receive buffer
  size_t buffer_size_bytes = buffer_size * sizeof(rmt_symbol_word_t);

  // Configure reception parameters
  rmt_receive_config_t rx_config = {};
  // Increase minimum signal range to account for timing variations, hardware delays, and signal
  // propagation
  rx_config.signal_range_min_ns =
      std::max(channel.actual_resolution_ns / 4,
               static_cast<hf_u32_t>(10)); // Allow signals down to half resolution

  // Set maximum signal range to a reasonable value for most applications (1ms instead of max
  // possible) This provides better noise filtering and prevents extremely long signals from
  // blocking reception
  rx_config.signal_range_max_ns = 1000000; // 1ms maximum signal duration

  // ESP-IDF v5.5 specific RX channel configuration flags
  // Note: rmt_receive_config_t only supports en_partial_rx flag, other flags are in
  // rmt_rx_channel_config_t
  rx_config.flags.en_partial_rx = false; // Disable partial reception for standard operation

  // Mark channel as busy
  channels_[channel_id].busy = true;
  channels_[channel_id].status.is_receiving = true;
  channels_[channel_id].status.timestamp_us = esp_timer_get_time();
  // Start RMT reception
  esp_err_t result = rmt_receive(channel.rx_channel, rmt_buffer, // Buffer for reception
                                 buffer_size_bytes, &rx_config);

  if (result != ESP_OK) {
    channels_[channel_id].busy = false;
    channels_[channel_id].status.is_receiving = false;
    ESP_LOGE(TAG, "Failed to start RMT reception on channel %d: %s", channel_id,
             esp_err_to_name(result));
    symbols_received = 0;
    InvokeChannelErrorCallback(channel_id, hf_pio_err_t::PIO_ERR_COMMUNICATION_FAILURE);
    return hf_pio_err_t::PIO_ERR_COMMUNICATION_FAILURE;
  }

