N3b3x/hf-internal-interface-wrap/src/mcu/esp32/EspPio.cpp
  // Wait for reception completion with timeout
  TickType_t timeout_ticks = pdMS_TO_TICKS(timeout_us / 1000);
  if (timeout_ticks == 0) {
    timeout_ticks = portMAX_DELAY;
  }

  // In a real implementation, we would use event groups or semaphores to wait for completion
  // For this implementation, we simulate immediate completion for demonstration
  // The actual symbols_received would be set by the RX completion callback

  // Simulate processing time
  vTaskDelay(pdMS_TO_TICKS(1));

  // Update status
  channels_[channel_id].busy = false;
  channels_[channel_id].status.is_receiving = false;
  symbols_received = 0; // Would be set by actual RMT reception
  channels_[channel_id].rx_symbols_received = symbols_received;
  channels_[channel_id].status.symbols_processed = symbols_received;
  channels_[channel_id].status.timestamp_us = esp_timer_get_time();
  channels_[channel_id].status.last_error = hf_pio_err_t::PIO_SUCCESS;

  // ESP_LOGD(TAG, "Received %lu raw RMT symbols on channel %d", symbols_received, channel_id);
  return hf_pio_err_t::PIO_SUCCESS;
}

size_t EspPio::GetMaxSymbolCount() const noexcept {
  // ESP32C6 RMT can handle large symbol counts with DMA enabled
  return 4096; // Reasonable limit for most applications
}

//==============================================================================
// PRIVATE HELPER METHODS
//==============================================================================

bool EspPio::IsValidChannelId(hf_u8_t channel_id) const noexcept {
  return channel_id < MAX_CHANNELS;
}

hf_pio_err_t EspPio::ConvertToRmtSymbols(const hf_pio_symbol_t* symbols, size_t symbol_count,
                                         rmt_symbol_word_t* rmt_symbols,
                                         size_t& rmt_symbol_count) noexcept {
  if (symbol_count > MAX_SYMBOLS_PER_TRANSMISSION) {
    return hf_pio_err_t::PIO_ERR_BUFFER_TOO_LARGE;
  }

  // Pack two hf_pio_symbol_t entries (high then low, or vice versa) into one rmt_symbol_word_t
  size_t out_index = 0;
  for (size_t i = 0; i < symbol_count;) {
    const hf_pio_symbol_t& first = symbols[i];
    rmt_symbol_word_t word = {};
    word.level0 = first.level ? 1 : 0;
    word.duration0 = first.duration;

    if (i + 1 < symbol_count) {
      const hf_pio_symbol_t& second = symbols[i + 1];
      word.level1 = second.level ? 1 : 0;
      word.duration1 = second.duration;
      i += 2;
    } else {
      // No second half; terminate with non-zero minimal duration
      word.level1 = first.level ? 0 : 1;
      word.duration1 = 1;
      i += 1;
    }

    rmt_symbols[out_index++] = word;
  }

  rmt_symbol_count = out_index;
  return hf_pio_err_t::PIO_SUCCESS;
}

hf_pio_err_t EspPio::ConvertFromRmtSymbols(const rmt_symbol_word_t* rmt_symbols,
                                           size_t rmt_symbol_count, hf_pio_symbol_t* symbols,
                                           size_t max_symbols, size_t& symbols_converted) noexcept {
  // CRITICAL DEBUG: Log all input parameters - ISR-safe logging
  ESP_EARLY_LOGI(TAG,
                 "ConvertFromRmtSymbols: DEBUG - Input: rmt_symbols=%p, rmt_symbol_count=%lu, "
                 "symbols=%p, max_symbols=%lu",
                 rmt_symbols, rmt_symbol_count, symbols, max_symbols);

  // Validate input parameters
  if (!rmt_symbols || !symbols) {
    ESP_EARLY_LOGE(TAG, "ConvertFromRmtSymbols: Invalid pointers - rmt_symbols=%p, symbols=%p",
                   rmt_symbols, symbols);
    symbols_converted = 0;
    return hf_pio_err_t::PIO_ERR_INVALID_PARAMETER;
  }

  if (rmt_symbol_count == 0) {
    ESP_EARLY_LOGE(TAG, "ConvertFromRmtSymbols: No RMT symbols to convert");
    symbols_converted = 0;
    return hf_pio_err_t::PIO_ERR_INVALID_PARAMETER;
  }

  if (max_symbols == 0) {
    ESP_EARLY_LOGE(TAG, "ConvertFromRmtSymbols: No space available in output buffer");
    symbols_converted = 0;
    return hf_pio_err_t::PIO_ERR_INVALID_PARAMETER;
  }

  // FIXED: Each RMT symbol contains TWO timing periods (high + low)
  // So we can convert up to 2 * rmt_symbol_count PIO symbols
  ESP_EARLY_LOGI(TAG, "ConvertFromRmtSymbols: DEBUG - max_pio_symbols=%lu (from input max_symbols)",
                 max_symbols);

  size_t symbols_to_convert = std::min(2 * rmt_symbol_count, max_symbols);

  ESP_EARLY_LOGI(TAG,
                 "ConvertFromRmtSymbols: DEBUG - symbols_to_convert=%lu (min of 2*%lu=%lu and %lu)",
                 symbols_to_convert, rmt_symbol_count, 2 * rmt_symbol_count, max_symbols);

  size_t pio_symbol_index = 0;

  // Convert RMT symbols to hf_pio_symbol_t format
  for (size_t i = 0; i < rmt_symbol_count && pio_symbol_index < max_symbols; ++i) {
    const rmt_symbol_word_t& rmt_sym = rmt_symbols[i];

    ESP_EARLY_LOGI(TAG,
                   "ConvertFromRmtSymbols: DEBUG - Processing RMT symbol %lu: level0=%s, "
                   "duration0=%u, level1=%s, duration1=%u",
                   i, rmt_sym.level0 ? "HIGH" : "LOW", rmt_sym.duration0,
                   rmt_sym.level1 ? "HIGH" : "LOW", rmt_sym.duration1);

    // First level (level0 + duration0) - always convert if we have space
    if (pio_symbol_index < max_symbols) {
      symbols[pio_symbol_index].level = rmt_sym.level0;
      symbols[pio_symbol_index].duration = rmt_sym.duration0;
      ESP_EARLY_LOGI(TAG,
                     "ConvertFromRmtSymbols: DEBUG - Created PIO symbol %lu: level=%s, duration=%u",
                     pio_symbol_index, symbols[pio_symbol_index].level ? "HIGH" : "LOW",
                     symbols[pio_symbol_index].duration);
      pio_symbol_index++;
    }

    // Second level (level1 + duration1) - always convert if we have space
    // Note: duration1=0 is valid and expected for the last symbol when signal never changes
    if (pio_symbol_index < max_symbols) {
      symbols[pio_symbol_index].level = rmt_sym.level1;
      symbols[pio_symbol_index].duration = rmt_sym.duration1;
      ESP_EARLY_LOGI(TAG,
                     "ConvertFromRmtSymbols: DEBUG - Created PIO symbol %lu: level=%s, duration=%u",
                     pio_symbol_index, symbols[pio_symbol_index].level ? "HIGH" : "LOW",
                     symbols[pio_symbol_index].duration);
      pio_symbol_index++;
    }
  }

  // Update the output symbols_converted with the actual number converted
  symbols_converted = pio_symbol_index;

