N3b3x/hf-internal-interface-wrap/src/mcu/esp32/EspPio.cpp
  ESP_EARLY_LOGI(
      TAG,
      "ConvertFromRmtSymbols: DEBUG - Final result: converted %lu RMT symbols to %lu PIO symbols",
      rmt_symbol_count, symbols_converted);

  return hf_pio_err_t::PIO_SUCCESS;
}

hf_pio_err_t EspPio::SetClockSource(hf_u8_t channel_id, rmt_clock_source_t clk_src) noexcept {
  PlatformUniqueLock<PlatformMutex> lock(state_mutex_);
  if (!IsValidChannelId(channel_id)) {
    return hf_pio_err_t::PIO_ERR_INVALID_CHANNEL;
  }
  auto& ch = channels_[channel_id];
  if (ch.busy) {
    return hf_pio_err_t::PIO_ERR_RESOURCE_BUSY;
  }
  ch.selected_clk_src = clk_src;
  ch.source_clock_hz = GetClockSourceFrequency(clk_src);
  return hf_pio_err_t::PIO_SUCCESS;
}

hf_pio_err_t EspPio::GetClockSource(hf_u8_t channel_id,
                                    rmt_clock_source_t& clk_src) const noexcept {
  PlatformUniqueLock<PlatformMutex> lock(state_mutex_);
  if (!IsValidChannelId(channel_id)) {
    return hf_pio_err_t::PIO_ERR_INVALID_CHANNEL;
  }
  clk_src = channels_[channel_id].selected_clk_src;
  return hf_pio_err_t::PIO_SUCCESS;
}

hf_pio_err_t EspPio::GetSourceClockHz(hf_u8_t channel_id, hf_u32_t& clock_hz) const noexcept {
  PlatformUniqueLock<PlatformMutex> lock(state_mutex_);
  if (!IsValidChannelId(channel_id)) {
    return hf_pio_err_t::PIO_ERR_INVALID_CHANNEL;
  }
  clock_hz = channels_[channel_id].source_clock_hz;
  return hf_pio_err_t::PIO_SUCCESS;
}

inline hf_u32_t EspPio::ResolveClockSourceHz(rmt_clock_source_t clk_src) noexcept {
#if SOC_CLK_TREE_SUPPORTED
  uint32_t freq = 0;
  switch (clk_src) {
  case RMT_CLK_SRC_DEFAULT:
    // APB / PLL_F80M is fixed 80 MHz
    return 80000000UL;
  case RMT_CLK_SRC_XTAL:
    // Query XTAL via clk tree
    esp_clk_tree_src_get_freq_hz(SOC_MOD_CLK_XTAL, ESP_CLK_TREE_SRC_FREQ_PRECISION_CACHED, &freq);
    return freq ? freq : 40000000UL;
  case RMT_CLK_SRC_RC_FAST:
    esp_clk_tree_src_get_freq_hz(SOC_MOD_CLK_RC_FAST, ESP_CLK_TREE_SRC_FREQ_PRECISION_CACHED,
                                 &freq);
    return freq ? freq : 17500000UL;
  default:
#if defined(CONFIG_IDF_TARGET_ESP32C6)
    return 80000000UL;
#else
    return 80000000UL;
#endif
  }
#else
  // Fallback: nominal constants
  return GetClockSourceFrequency(clk_src);
#endif
}

// Legacy alias retained for internal calls
inline hf_u32_t EspPio::GetClockSourceFrequency(rmt_clock_source_t clk_src) noexcept {
  switch (clk_src) {
  case RMT_CLK_SRC_DEFAULT:
    return 80000000UL;
  case RMT_CLK_SRC_XTAL:
    return 40000000UL;
  case RMT_CLK_SRC_RC_FAST:
    return 17500000UL;
  default:
    return 80000000UL;
  }
}

hf_u32_t EspPio::CalculateClockDivider(hf_u32_t resolution_ns, hf_u32_t& actual_resolution_ns,
                                       hf_u32_t source_clock_hz) const noexcept {
  if (resolution_ns == 0) {
    ESP_LOGW(TAG, "Invalid resolution_ns=0, using minimum resolution");
    actual_resolution_ns = 1000000000UL / source_clock_hz;
    return 1;
  }

  uint64_t divider_calc = ((uint64_t)resolution_ns * source_clock_hz) / 1000000000ULL;

  hf_u32_t divider;
  if (divider_calc < 1) {
    divider = 1;
  } else if (divider_calc > 255) {
    divider = 255;
  } else {
    divider = static_cast<hf_u32_t>(divider_calc);
  }

  actual_resolution_ns = (1000000000ULL * divider) / source_clock_hz;
  return divider;
}

uint32_t EspPio::GetEffectiveClockFrequency(uint32_t clock_divider,
                                            uint32_t source_clock_hz) const noexcept {
  if (clock_divider == 0) {
    ESP_LOGE(TAG, "Invalid clock_divider=0");
    return 0;
  }
  return source_clock_hz / clock_divider;
}

hf_pio_err_t EspPio::ValidateChannelConfiguration(
    hf_u8_t channel_id, const hf_pio_channel_config_t& config) const noexcept {
  // Validate GPIO pin
  if (config.gpio_pin < 0) {
    ESP_LOGE(TAG, "Invalid GPIO pin %d for channel %d", config.gpio_pin, channel_id);
    return hf_pio_err_t::PIO_ERR_INVALID_PARAMETER;
  }

  // Validate resolution is within supported range
  // Get the constraints for the current hardware
  hf_u32_t min_resolution_ns, max_resolution_ns, clock_freq_hz;
  GetResolutionConstraints(min_resolution_ns, max_resolution_ns, clock_freq_hz);

  if (config.resolution_ns < min_resolution_ns || config.resolution_ns > max_resolution_ns) {
    ESP_LOGE(TAG, "Invalid resolution %uns for channel %d (range: %u-%uns)", config.resolution_ns,
             channel_id, min_resolution_ns, max_resolution_ns);
    ESP_LOGE(TAG, "Hardware constraint: 8-bit divider (1-255) with %u Hz clock", clock_freq_hz);
    return hf_pio_err_t::PIO_ERR_INVALID_RESOLUTION;
  }

  // Validate channel is appropriate for the direction on current ESP32 variant
  if (!HfRmtIsChannelValidForDirection(channel_id, config.direction)) {
    ESP_LOGE(TAG, "Channel %d is not valid for %s direction on %s", channel_id,
             (config.direction == hf_pio_direction_t::Transmit)  ? "TX"
             : (config.direction == hf_pio_direction_t::Receive) ? "RX"
                                                                 : "Bidirectional",
             HfRmtGetVariantName());

    // Provide helpful suggestions
    if (config.direction == hf_pio_direction_t::Transmit) {
      ESP_LOGE(TAG, "Valid TX channels for %s: %d-%d", HfRmtGetVariantName(),
               HF_RMT_TX_CHANNEL_START, HF_RMT_TX_CHANNEL_START + HF_RMT_MAX_TX_CHANNELS - 1);
    } else if (config.direction == hf_pio_direction_t::Receive) {
      ESP_LOGE(TAG, "Valid RX channels for %s: %d-%d", HfRmtGetVariantName(),
               HF_RMT_RX_CHANNEL_START, HF_RMT_RX_CHANNEL_START + HF_RMT_MAX_RX_CHANNELS - 1);
    }

    return hf_pio_err_t::PIO_ERR_INVALID_CHANNEL;
  }

  // Validate buffer size
  if (config.buffer_size == 0) {
    ESP_LOGE(TAG, "Invalid buffer size 0 for channel %d", channel_id);
    return hf_pio_err_t::PIO_ERR_INVALID_PARAMETER;
  }

  // Validate timeout
  if (config.timeout_us == 0) {
    ESP_LOGW(TAG, "Timeout is 0 for channel %d - operations will block indefinitely", channel_id);
  }

  // ESP_LOGD(TAG, "Channel %d configuration validated successfully for %s", channel_id,
  // HfRmtGetVariantName());
  return hf_pio_err_t::PIO_SUCCESS;
}

void EspPio::InvokeChannelErrorCallback(hf_u8_t channel_id, hf_pio_err_t error) noexcept {
  if (!IsValidChannelId(channel_id)) {
    ESP_LOGE(TAG, "Invalid channel ID %d for error callback", channel_id);
    return;
  }

  auto& channel = channels_[channel_id];

