N3b3x/hf-internal-interface-wrap/src/mcu/esp32/EspPio.cpp
  // Invoke channel-specific error callback if set
  if (channel.error_callback) {
    channel.error_callback(channel_id, error, channel.error_user_data);
  }

  // Update channel status
  channel.status.last_error = error;
}

bool EspPio::OnTransmitComplete(rmt_channel_handle_t channel, const rmt_tx_done_event_data_t* edata,
                                void* user_ctx) {
  auto* instance = static_cast<EspPio*>(user_ctx);
  if (!instance) {
    return false;
  }

  // Find the channel ID by comparing channel handles - minimize stack usage
  hf_u8_t channel_id = 0xFF;
  for (hf_u8_t i = 0; i < MAX_CHANNELS; ++i) {
    if (instance->channels_[i].tx_channel == channel) {
      channel_id = i;
      break;
    }
  }

  if (channel_id == 0xFF) {
    ESP_EARLY_LOGE(TAG, "OnTransmitComplete: Channel handle %p not found", channel);
    return false;
  }

  // ISR context: minimize stack usage and avoid blocking operations
  auto& ch = instance->channels_[channel_id];

  // Update channel status atomically
  ch.busy = false;
  ch.status.is_transmitting = false;
  ch.status.symbols_processed = ch.status.symbols_queued;
  ch.status.timestamp_us = esp_timer_get_time();

  // Invoke channel-specific user callback if set - ISR-safe context
  if (ch.transmit_callback) {
    // Callback is invoked from ISR context - user must ensure ISR safety
    ch.transmit_callback(channel_id, ch.status.symbols_processed, ch.transmit_user_data);
  }

  ESP_EARLY_LOGD(TAG, "TX complete ch%d: %lu symbols", channel_id, ch.status.symbols_processed);
  return false; // Don't yield to higher priority task
}

bool EspPio::OnReceiveComplete(rmt_channel_handle_t channel, const rmt_rx_done_event_data_t* edata,
                               void* user_ctx) {
  auto* instance = static_cast<EspPio*>(user_ctx);
  if (!instance || !edata) {
    ESP_EARLY_LOGE(TAG, "OnReceiveComplete: Invalid instance or event data");
    return false;
  }

  // Find the channel ID by comparing channel handles - minimize stack usage
  hf_u8_t channel_id = 0xFF;
  for (hf_u8_t i = 0; i < MAX_CHANNELS; ++i) {
    if (instance->channels_[i].rx_channel == channel) {
      channel_id = i;
      break;
    }
  }

  if (channel_id == 0xFF) {
    ESP_EARLY_LOGE(TAG, "OnReceiveComplete: Channel handle %p not found", channel);
    return false;
  }

  auto& ch = instance->channels_[channel_id];

  // ISR context: minimize logging and stack usage
  ESP_EARLY_LOGI(TAG, "OnReceiveComplete: ch%d received %lu symbols", channel_id,
                 edata->num_symbols);

  // Convert received RMT symbols back to hf_pio_symbol_ts - minimize stack usage
  size_t symbols_converted = 0;
  if (ch.rx_buffer && edata->received_symbols) {
    // Convert RMT symbols to PIO symbols - this is the critical operation
    // Use minimal error checking to prevent stack issues
    hf_pio_err_t convert_result = instance->ConvertFromRmtSymbols(
        reinterpret_cast<const rmt_symbol_word_t*>(edata->received_symbols), edata->num_symbols,
        ch.rx_buffer, ch.rx_buffer_size, symbols_converted);

    if (convert_result != hf_pio_err_t::PIO_SUCCESS) {
      ESP_EARLY_LOGE(TAG, "OnReceiveComplete: ch%d conversion failed: %d", channel_id,
                     static_cast<int>(convert_result));
      symbols_converted = 0; // Ensure we don't use corrupted data
    }

    ESP_EARLY_LOGI(TAG, "OnReceiveComplete: ch%d converted %lu symbols", channel_id,
                   symbols_converted);
  } else {
    ESP_EARLY_LOGE(TAG, "OnReceiveComplete: ch%d missing buffers", channel_id);
  }

  ch.busy = false;
  ch.rx_symbols_received = symbols_converted;
  ch.status.symbols_processed = symbols_converted;
  ch.status.timestamp_us = esp_timer_get_time();

  // Invoke channel-specific user callback if set - ISR-safe context
  if (ch.receive_callback) {
    // Callback is invoked from ISR context - user must ensure ISR safety
    ch.receive_callback(channel_id, ch.rx_buffer, symbols_converted, ch.receive_user_data);
  }

  ESP_EARLY_LOGI(TAG, "OnReceiveComplete: ch%d completed, %lu symbols", channel_id,
                 symbols_converted);
  return true; // Allow yielding to higher priority task
}

hf_pio_err_t EspPio::InitializeChannel(hf_u8_t channel_id) noexcept {
  auto& channel = channels_[channel_id];
  const auto& config = channel.config;

  // Choose clock source: use user-selected if set, otherwise target default
  rmt_clock_source_t default_src = RMT_CLK_SRC_DEFAULT;
  rmt_clock_source_t chosen_src = (channels_[channel_id].selected_clk_src == RMT_CLK_SRC_DEFAULT)
                                      ? default_src
                                      : channels_[channel_id].selected_clk_src;
  channel.selected_clk_src = chosen_src;
  channel.source_clock_hz = GetClockSourceFrequency(chosen_src);

  // Calculate clock settings from requested ns and selected source clock
  hf_u32_t actual_resolution_ns;
  hf_u32_t resolution_hz =
      CalculateResolutionHz(config.resolution_ns, actual_resolution_ns, channel.source_clock_hz);
  channel.actual_resolution_ns = actual_resolution_ns;

  if (config.direction == hf_pio_direction_t::Transmit ||
      config.direction == hf_pio_direction_t::Bidirectional) {
    rmt_tx_channel_config_t tx_config = {};
    tx_config.gpio_num = static_cast<gpio_num_t>(config.gpio_pin);
    tx_config.clk_src = RMT_CLK_SRC_DEFAULT; // APB on ESP32, PLL_F80M on C6 (both 80 MHz)
    tx_config.resolution_hz = resolution_hz;
    // Balanced buffering to allow multi-channel allocations
    tx_config.mem_block_symbols = 64;
    tx_config.trans_queue_depth = 8;

    // ESP-IDF v5.5 specific TX channel configuration
    tx_config.flags.invert_out = false;   // Don't invert output signal
    tx_config.flags.with_dma = false;     // Disable DMA for standard operation
    tx_config.flags.io_loop_back = false; // Disable internal loopback
    tx_config.intr_priority = 0;          // Default interrupt priority

    esp_err_t ret = rmt_new_tx_channel(&tx_config, &channel.tx_channel);
    if (ret != ESP_OK) {
      ESP_LOGE(TAG, "Failed to create TX channel %d: %s (error: %d)", channel_id,
               esp_err_to_name(ret), ret);
      return hf_pio_err_t::PIO_ERR_HARDWARE_FAULT;
    }

