N3b3x/hf-internal-interface-wrap/src/mcu/esp32/EspPio.cpp
    rmt_copy_encoder_config_t encoder_config = {};
    ret = rmt_new_copy_encoder(&encoder_config, &channel.encoder);
    if (ret != ESP_OK) {
      ESP_LOGE(TAG, "Failed to create encoder for channel %d: %d", channel_id, ret);
      rmt_del_channel(channel.tx_channel);
      channel.tx_channel = nullptr;
      return hf_pio_err_t::PIO_ERR_HARDWARE_FAULT;
    }

    // Register TX done callback once at channel bring-up
    {
      rmt_tx_event_callbacks_t tx_callbacks = {};
      tx_callbacks.on_trans_done = OnTransmitComplete;
      esp_err_t cb_ret = rmt_tx_register_event_callbacks(channel.tx_channel, &tx_callbacks, this);
      if (cb_ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to register TX callbacks for channel %d: %d", channel_id, cb_ret);
        rmt_del_encoder(channel.encoder);
        rmt_del_channel(channel.tx_channel);
        channel.tx_channel = nullptr;
        return hf_pio_err_t::PIO_ERR_HARDWARE_FAULT;
      }
    }

    ret = rmt_enable(channel.tx_channel);
    if (ret != ESP_OK) {
      ESP_LOGE(TAG, "Failed to enable TX channel %d: %d", channel_id, ret);
      return hf_pio_err_t::PIO_ERR_HARDWARE_FAULT;
    }
  }

  if (config.direction == hf_pio_direction_t::Receive ||
      config.direction == hf_pio_direction_t::Bidirectional) {
    // Configure advanced RX channel for ESP32-C6 compatibility
    rmt_rx_channel_config_t rx_config = {};
    rx_config.gpio_num = static_cast<gpio_num_t>(config.gpio_pin);
    rx_config.clk_src = RMT_CLK_SRC_DEFAULT; // APB on ESP32, PLL_F80M on C6 (both 80 MHz)
    rx_config.resolution_hz = resolution_hz;
    rx_config.mem_block_symbols = 64;

    // ESP-IDF v5.5 specific RX channel configuration
    rx_config.flags.invert_in = false;    // Don't invert input signal
    rx_config.flags.with_dma = false;     // Disable DMA for standard operation
    rx_config.flags.io_loop_back = false; // Disable internal loopback
    rx_config.intr_priority = 0;          // Default interrupt priority

    esp_err_t ret = rmt_new_rx_channel(&rx_config, &channel.rx_channel);
    if (ret != ESP_OK) {
      ESP_LOGE(TAG, "Failed to create RX channel %d: %d", channel_id, ret);
      return hf_pio_err_t::PIO_ERR_HARDWARE_FAULT;
    }

    // Register RX done callback once at channel bring-up
    {
      rmt_rx_event_callbacks_t rx_callbacks = {};
      rx_callbacks.on_recv_done = OnReceiveComplete;
      esp_err_t cb_ret = rmt_rx_register_event_callbacks(channel.rx_channel, &rx_callbacks, this);
      if (cb_ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to register RX callbacks for channel %d: %d", channel_id, cb_ret);
        rmt_del_channel(channel.rx_channel);
        channel.rx_channel = nullptr;
        return hf_pio_err_t::PIO_ERR_HARDWARE_FAULT;
      }
    }

    ret = rmt_enable(channel.rx_channel);
    if (ret != ESP_OK) {
      ESP_LOGE(TAG, "Failed to enable RX channel %d: %d", channel_id, ret);
      return hf_pio_err_t::PIO_ERR_HARDWARE_FAULT;
    }
  }

  ESP_LOGI(TAG, "Initialized channel %d: clk_src=%d (%u Hz), requested %uns, achieved %uns (%u Hz)",
           channel_id, static_cast<int>(chosen_src), channel.source_clock_hz, config.resolution_ns,
           channel.actual_resolution_ns, 1000000000UL / channel.actual_resolution_ns);
  return hf_pio_err_t::PIO_SUCCESS;
}

hf_pio_err_t EspPio::DeinitializeChannel(hf_u8_t channel_id) noexcept {
  auto& channel = channels_[channel_id];

  if (channel.tx_channel) {
    rmt_disable(channel.tx_channel);
    rmt_del_channel(channel.tx_channel);
    channel.tx_channel = nullptr;
  }

  if (channel.rx_channel) {
    rmt_disable(channel.rx_channel);
    rmt_del_channel(channel.rx_channel);
    channel.rx_channel = nullptr;
  }

  if (channel.encoder) {
    rmt_del_encoder(channel.encoder);
    // If bytes_encoder aliases encoder, avoid double-free
    if (channel.bytes_encoder == channel.encoder) {
      channel.bytes_encoder = nullptr;
    }
    channel.encoder = nullptr;
  }
  if (channel.bytes_encoder) {
    rmt_del_encoder(channel.bytes_encoder);
    channel.bytes_encoder = nullptr;
  }

  // Free allocated RMT buffer if present
  if (channel.rmt_rx_buffer != nullptr) {
    heap_caps_free(channel.rmt_rx_buffer);
    channel.rmt_rx_buffer = nullptr;
  }

  // Clear buffer references
  channel.rx_buffer = nullptr;
  channel.rx_buffer_size = 0;
  channel.rx_symbols_received = 0;

  channel.configured = false;
  channel.busy = false;

  ESP_LOGI(TAG, "Deinitialized channel %d", channel_id);
  return hf_pio_err_t::PIO_SUCCESS;
}

hf_pio_err_t EspPio::ValidateSymbols(const hf_pio_symbol_t* symbols,
                                     size_t symbol_count) const noexcept {
  for (size_t i = 0; i < symbol_count; ++i) {
    if (symbols[i].duration == 0) {
      return hf_pio_err_t::PIO_ERR_DURATION_TOO_SHORT;
    }
    if (symbols[i].duration > 32767) { // RMT 15-bit duration limit
      return hf_pio_err_t::PIO_ERR_DURATION_TOO_LONG;
    }
  }
  return hf_pio_err_t::PIO_SUCCESS;
}

bool EspPio::ValidatePioSystem() noexcept {
  ESP_LOGI(TAG, "Starting comprehensive PIO system validation");

  if (!EnsureInitialized()) {
    ESP_LOGE(TAG, "PIO system validation failed: not initialized");
    return false;
  }

  bool all_tests_passed = true;

  // Test 1: Verify RMT peripheral is available
  ESP_LOGI(TAG, "Testing RMT peripheral availability...");

  // Test 2: Validate channel configuration
  ESP_LOGI(TAG, "Testing channel configuration...");
  for (hf_u8_t i = 0; i < MAX_CHANNELS; ++i) {
    if (!IsValidChannelId(i)) {
      ESP_LOGE(TAG, "Invalid channel ID: %d", i);
      all_tests_passed = false;
    }
  }

  // Test 3: Check maximum symbol count
  size_t max_symbols = GetMaxSymbolCount();
  if (max_symbols == 0) {
    ESP_LOGE(TAG, "Invalid maximum symbol count: %lu", max_symbols);
    all_tests_passed = false;
  } else {
    ESP_LOGI(TAG, "Maximum symbol count: %lu", max_symbols);
  }

  // Test 4: Validate symbol conversion functions
  ESP_LOGI(TAG, "Testing symbol conversion functions...");
  hf_pio_symbol_t test_symbols[] = {{100, true}, {200, false}, {150, true}};
  rmt_symbol_word_t rmt_symbols[10];
  size_t rmt_symbol_count = 0;

  hf_pio_err_t result = ConvertToRmtSymbols(test_symbols, 3, rmt_symbols, rmt_symbol_count);
  if (result != hf_pio_err_t::PIO_SUCCESS) {
    ESP_LOGE(TAG, "Symbol conversion test failed: %d", static_cast<int>(result));
    all_tests_passed = false;
  }

  // Test 5: Validate symbol validation function
  ESP_LOGI(TAG, "Testing symbol validation...");
  result = ValidateSymbols(test_symbols, 3);
  if (result != hf_pio_err_t::PIO_SUCCESS) {
    ESP_LOGE(TAG, "Symbol validation test failed: %d", static_cast<int>(result));
    all_tests_passed = false;
  }

