N3b3x/hf-internal-interface-wrap/src/mcu/esp32/EspPio.cpp
  // Test 6: Validate clock divider calculation
  ESP_LOGI(TAG, "Testing clock divider calculation...");
  hf_u32_t actual_ns_test = 0;
  hf_u32_t divider = CalculateClockDivider(
      1000, actual_ns_test,
      GetClockSourceFrequency(
          channels_[0].selected_clk_src)); // 1 microsecond using a channel clock
  if (divider == 0 || divider > 255) {
    ESP_LOGE(TAG, "Clock divider calculation failed: %d", divider);
    all_tests_passed = false;
  } else {
    ESP_LOGD(TAG, "Divider=%u, actual_ns=%u", divider, actual_ns_test);
  }

  // Test 7: Validate capabilities structure
  ESP_LOGI(TAG, "Testing capabilities...");
  hf_pio_capabilities_t caps;
  result = GetCapabilities(caps);
  if (result != hf_pio_err_t::PIO_SUCCESS || caps.max_channels == 0) {
    ESP_LOGE(TAG, "Capabilities test failed");
    all_tests_passed = false;
  }

  // Test 8: Memory allocation test (simulate)
  ESP_LOGI(TAG, "Testing memory allocation patterns...");
  for (size_t mem_size : {48, 64, 128, 256, 512, 1024}) {
    if (mem_size < HF_RMT_MIN_MEM_BLOCK_SYMBOLS || mem_size > HF_RMT_MAX_MEM_BLOCK_SYMBOLS) {
      ESP_LOGW(TAG, "Memory size %lu outside valid range", mem_size);
    }
  }

  if (all_tests_passed) {
    ESP_LOGI(TAG, "PIO system validation completed successfully - all tests passed");
  } else {
    ESP_LOGE(TAG, "PIO system validation failed - some tests did not pass");
  }

  return all_tests_passed;
}

//==============================================================================
// STATISTICS AND DIAGNOSTICS
//==============================================================================

hf_pio_err_t EspPio::GetStatistics(hf_u8_t channel_id,
                                   hf_pio_statistics_t& statistics) const noexcept {
  if (!IsValidChannelId(channel_id)) {
    return hf_pio_err_t::PIO_ERR_INVALID_CHANNEL;
  }

  // For now, return global statistics
  // In a real implementation, this would gather channel-specific statistics
  statistics = global_statistics_;
  return hf_pio_err_t::PIO_SUCCESS;
}

hf_pio_err_t EspPio::GetDiagnostics(hf_u8_t channel_id,
                                    hf_pio_diagnostics_t& diagnostics) const noexcept {
  if (!IsValidChannelId(channel_id)) {
    return hf_pio_err_t::PIO_ERR_INVALID_CHANNEL;
  }

  const auto& channel = channels_[channel_id];

  // Fill in channel-specific diagnostics
  diagnostics = global_diagnostics_;
  diagnostics.pioInitialized = initialized_;
  diagnostics.activeChannels = 0;

  // Count active channels
  for (const auto& ch : channels_) {
    if (ch.configured) {
      diagnostics.activeChannels++;
    }
  }

  diagnostics.lastErrorCode = channel.status.last_error;
  diagnostics.currentResolutionNs = channel.actual_resolution_ns; // Use actual achieved resolution

  return hf_pio_err_t::PIO_SUCCESS;
}

#endif // HF_MCU_FAMILY_ESP32